package test;

import java.util.ArrayList;
import java.util.List;

import com.tourism.gis.bean.LandMark;
import com.tourism.gis.util.CommonUtils;

public class TestLandMark {

	public static List<LandMark> getList() {
		LandMark l1 = new LandMark(CommonUtils.uuid(), 36.681409, 117.032386, "济南市历下区大明湖公园", "0531-86088945", "",
				"四面荷花三面柳，一城山色半城湖。济南三大名胜之一，是繁华都市中一处难得的天然湖泊，素有“泉城明珠”的美誉它位于济南市中心偏东北处、旧城区北部。早在唐宋时期，大明湖就以其撼人心弦的美景而闻名四海。“蛇不见，蛙不鸣，久雨不涨，久旱不涸”为大明湖的四大怪。");
		LandMark l2 = new LandMark(CommonUtils.uuid(), 36.681197, 117.038578, "济南市历下区超然楼", "0531-86088945", "",
				"江北第一楼——超然楼，位于济南天下第一泉风景区大明湖畔。是一座拥有几百年历史的名楼，始建于元代。");
		LandMark l3 = new LandMark(CommonUtils.uuid(), 36.491917, 117.174948, "济南市历城区红叶谷", "0531-82818666", "",
				"红叶谷生态文化旅游区是由济南园林开发建设集团兴建的以生态文化为主题的大型近郊旅游风景区。位于济南南部山区仲宫镇，距济南市区33千米，紧靠南绕城高速济南南出口并与京福高速公路相连，有省道327线直达，交通便利，地理位置得天独厚。");
		LandMark l4 = new LandMark(CommonUtils.uuid(), 36.667945, 117.022831, "济南市市中区趵突泉", "0531-86920680", "",
				"海内之名泉第一，齐门之胜地无双，天下第一泉风景区位于济南市市中心，由“一河（护城河）一湖（大明湖）三泉（趵突泉、黑虎泉、五龙潭三大泉群）四园（趵突泉公园、环城公园、五龙潭公园、大明湖风景名胜区）”组成。");

		LandMark l5 = new LandMark(CommonUtils.uuid(), 36.672192, 117.02127, "济南市天桥区五龙潭公园", "0531-86924835", "",
				"五龙潭也是济南一大奇迹，位于济南旧城西门外，泺源桥北，因内有五龙潭而得名。五龙潭居公园中部。据《水经注》记载，北魏以前就有这片水，称净池，是大明湖的一隅。相传，五龙潭昔日潭深莫测，每遇大旱，祷雨则应，故元代有好事者在潭边建庙，内塑五方龙神，自此便改称五龙潭。");
		LandMark l6 = new LandMark(CommonUtils.uuid(), 36.371032, 116.993301, "济南市长清区灵岩寺旅游区", "0531-87468097", "",
				"灵岩寺风景区位于济南市长清区万德街道境内，北依济南，南靠泰山，为山东地区佛教圣地，以其悠久的宗教历史和深厚的文化内涵驰名于世，明代文学家王世贞有“灵岩是泰山背最幽绝处，游泰山不至灵岩不成游也”之说。");
		LandMark l7 = new LandMark(CommonUtils.uuid(), 36.725019, 117.544882, "济南市章丘区百脉泉公园", "0531-83239900", "",
				"百脉泉公园座落在明水东侧，因闻名遐迩的百脉泉而得名，是全球优秀生态旅游景区、国家4A级旅游景区、山东省服务名牌，总面积1300亩。景区以独特的泉水为载体，以深厚的文化为底蕴，彰显鲜明的地域特色，弘扬卓然一家的清照文化，形成了泉水景观、生态景观、文化景观于一体的山水文化园林。");

		List<LandMark> list = new ArrayList<>();
		list.add(l1);
		list.add(l2);
		list.add(l3);
		list.add(l4);
		list.add(l5);
		list.add(l6);
		list.add(l7);
		return list;
	}

	public static void main(String[] args) {

	}
}
